Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_СостояниеБота.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_СостояниеБота</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекущийЭтап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ЭтапыСценария</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвободныйПараметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ОчередьРаспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ОчередьРаспределения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаКонцаБронирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПродлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейАктивности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнимПисалОператор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсобыйЧат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оператор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ПоследниеСтатусыЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ПоследниеСтатусыЧатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОчереди</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_СтатусыОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыЭтапов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыЭтапов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информационный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеВвода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаОператора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_СтатусыОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_СтатусыОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ожидание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросСоединения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщениеСБотом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнеОчереди</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыТекстаЭтапа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыТекстаЭтапа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПростойТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шаблон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_ЭтапыСценария.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_ЭтапыСценария</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипЭтапа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыЭтапов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередОбработкойЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПослеОбработкиЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.iga_ТипыТекстаЭтапа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверочныйКодПосле</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Команда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.iga_КомандыОбработкиОтвета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледующийЭтап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.iga_ЭтапыСценария</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПослеОбработкиКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроверочныйКодПосле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыПроизвольногоТекста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеИсточник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/CommonModules/iga_БотСценарииСервер/Ext/Module.bsl
Процедура ВыполнитьОбработчикПередЭтапом(НовыйЭтап, ЧатСсылка, ИдЧата, ТекущийЭтап, НормТекст, ВыборКнопки, ВходящиеПараметры) Экспорт
	
	Если Не ТекущийЭтап.ПередОбработкойЭтапа = "" Тогда 
		Обработчик = Обработки.iga_ОбработчикЭтапов.Создать();
		Обработчик.ВходящиеПараметры = Новый Структура("Чат, ИдЧата, ТекущийЭтап, НовыйЭтап, ТекстСообщения, ВыборКнопки, НовыеПараметры", 
			ЧатСсылка, ИдЧата, ТекущийЭтап, НовыйЭтап, НормТекст, ВыборКнопки, Новый Структура);
		
		Если Не ВходящиеПараметры = Неопределено Тогда 
			Для Каждого Параметр Из ВходящиеПараметры Цикл
				Обработчик.ВходящиеПараметры.Вставить(Параметр.Ключ, Параметр.Значение);
			КонецЦикла;
		КонецЕсли;
						
		Обработчик.ВыполнитьОбработчикСУчетомАлгоритмов(ТекущийЭтап.ПередОбработкойЭтапа);
		Если Не Обработчик.ВходящиеПараметры.НовыеПараметры.Количество() > 0 Тогда
			Для Каждого НовыйПарметр Из Обработчик.ВходящиеПараметры.НовыеПараметры Цикл
				iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ЧатСсылка, НовыйПарметр.Ключ, НовыйПарметр.Значение);
			КонецЦикла;
			Обработчик.ВходящиеПараметры.НовыеПараметры.Очистить();
		КонецЕсли;
		
		ВходящиеПараметры = Обработчик.ВходящиеПараметры;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьВходящееСообщение(ЧатСсылка, ИдЧата, ТекстВходящегоСообщения, ВыборКнопки = 0, БезОбщенияСБотом = Ложь, ВходящиеПараметры = Неопределено) Экспорт
	
	НормТекст = СокрЛП(ТекстВходящегоСообщения);
	
	ЗаписьСостояния = РегистрыСведений.iga_СостояниеБота.СоздатьМенеджерЗаписи();
	ЗаписьСостояния.Чат = ЧатСсылка;
	ЗаписьСостояния.Прочитать();

	ТекущийЭтап = Неопределено;
	
	Если ЗаписьСостояния.Выбран() Тогда

		ТекущийЭтап = ЗаписьСостояния.ТекущийЭтап;
			
		РезультатПоиска = НайтиСледующийЭтапПоКоманде(ЧатСсылка, ИдЧата, ТекущийЭтап, НормТекст, ВыборКнопки);
		НовыйЭтап = РезультатПоиска.Этап;
		
		Если ВходящиеПараметры = Неопределено Тогда
			ВходящиеПараметры = Новый Структура("Чат, ИдЧата, ТекущийЭтап, НовыйЭтап, ТекстСообщения, ВыборКнопки, НовыеПараметры", 
				ЧатСсылка, ИдЧата, ТекущийЭтап, НовыйЭтап, НормТекст, ВыборКнопки, Новый Структура);
		КонецЕсли;
		
		ВыполнитьОбработчикПередЭтапом(НовыйЭтап, ЧатСсылка, ИдЧата, ТекущийЭтап, НормТекст, ВыборКнопки, ВходящиеПараметры);
		
		Если ЗначениеЗаполнено(НовыйЭтап) Тогда

			ВыполнитьЭтап(ЧатСсылка, ИдЧата, ТекущийЭтап, НовыйЭтап, ЗаписьСостояния, БезОбщенияСБотом, ВходящиеПараметры);
			Если Не РезультатПоиска.ПослеОбработкиКоманды = "" Тогда
				ОбработчикАлгоритвом = Обработки.iga_ОбработчикЭтапов.Создать();
				ОбработчикАлгоритвом.ВходящиеПараметры = ВходящиеПараметры;
				ОбработчикАлгоритвом.ВыполнитьОбработчикСУчетомАлгоритмов(РезультатПоиска.ПослеОбработкиКоманды);
			КонецЕсли;
		
		Иначе

			ОтправитьТекстЭтапа(ЧатСсылка, ИдЧата, ТекущийЭтап, ВходящиеПараметры);
		КонецЕсли;
		
		
	Иначе

		ТекущийЭтап = Константы.iga_СтартовыйЭтапБота.Получить();
		
		Если ВходящиеПараметры = Неопределено Тогда
			ВходящиеПараметры = Новый Структура("Чат, ИдЧата, ТекущийЭтап, ПредыдущийЭтап, ТекстСообщения, ВыборКнопки, НовыеПараметры", 
				ЧатСсылка, ИдЧата, ТекущийЭтап, Неопределено, НормТекст, ВыборКнопки, Новый Структура);
		КонецЕсли;

		ВыполнитьОбработчикПередЭтапом(Неопределено, ЧатСсылка, ИдЧата, ТекущийЭтап, НормТекст, ВыборКнопки, ВходящиеПараметры);
		
		ВыполнитьЭтап(ЧатСсылка, ИдЧата, Неопределено, ТекущийЭтап, ЗаписьСостояния, БезОбщенияСБотом, ВходящиеПараметры);

	КонецЕсли;
	
КонецПроцедуры

Функция НайтиСледующийЭтапПоКоманде(ЧатСсылка, ИдЧата, ЭтапСсылка, Команда, ВыборКнопки) Экспорт
	
	Результат = Новый Структура("Этап, ПослеОбработкиКоманды", Справочники.iga_ЭтапыСценария.ПустаяСсылка(), "");
	ЭтапЗвездочка = Справочники.iga_ЭтапыСценария.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Варианты.Команда КАК Команда,
		|	Варианты.СледующийЭтап КАК СледующийЭтап,
		|	Варианты.Команда.АлгоритмПроверки КАК КомандаАлгоритмПроверки,
		|	Варианты.ПослеОбработкиКоманды КАК ПослеОбработкиКоманды
		|ИЗ
		|	Справочник.iga_ЭтапыСценария.ВариантыОтветов КАК Варианты
		|ГДЕ
		|	Варианты.Ссылка = &Этап";
	Запрос.УстановитьПараметр("Этап", ЭтапСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВходящиеПараметры = Новый Структура("Чат, ИдЧата, Команда, ВыборКнопки", ЧатСсылка, ИдЧата, Команда, ВыборКнопки);
	
	ОбработчикАлгоритвом = Обработки.iga_ОбработчикЭтапов.Создать();
	ОбработчикАлгоритвом.ВходящиеПараметры = ВходящиеПараметры;
	
	Пока Выборка.Следующий() Цикл
		
		
		РезультатОбработкиКоманды = ОбработчикАлгоритвом.ВыполнитьОбработчикСУчетомАлгоритмов(Выборка.КомандаАлгоритмПроверки);
		
		Если РезультатОбработкиКоманды = Истина Тогда
			Результат.Этап = Выборка.СледующийЭтап;
			Результат.ПослеОбработкиКоманды = Выборка.ПослеОбработкиКоманды;
			
			Возврат Результат; 
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьЭтап(ЧатСсылка, ИдЧата, ПредыдущийЭтап, ЭтапСсылка, ЗаписьСостояния = Неопределено, БезОбщенияСБотом = Ложь, ВходящиеПараметры = Неопределено) Экспорт
	
	ТипЭтапа = ЭтапСсылка.ТипЭтапа;
	
	Если ЗаписьСостояния = Неопределено Тогда
		ЗаписьСостояния = РегистрыСведений.iga_СостояниеБота.СоздатьМенеджерЗаписи();
	КонецЕсли;

	ОтправитьТекстЭтапа(ЧатСсылка, ИдЧата, ЭтапСсылка, ВходящиеПараметры);
	
	
	Если Не ПредыдущийЭтап = Неопределено Тогда
		ОбработчикАлгоритвом = Обработки.iga_ОбработчикЭтапов.Создать();
		ОбработчикАлгоритвом.ВходящиеПараметры = ВходящиеПараметры;
		ОбработчикАлгоритвом.ВыполнитьОбработчикСУчетомАлгоритмов(ПредыдущийЭтап.ПослеОбработкиЭтапа);
	КонецЕсли;
	
	Если ТипЭтапа = Перечисления.iga_ТипыЭтапов.ОжиданиеВвода Тогда
		
		ЗаписьСостояния.Чат = ЧатСсылка;
		ЗаписьСостояния.ТекущийЭтап = ЭтапСсылка;
		ЗаписьСостояния.ДатаАктивности = ТекущаяДата();
		ЗаписьСостояния.Записать();
		
		Если Не БезОбщенияСБотом Тогда
			ЗаписьОчереди = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
			ЗаписьОчереди.Чат = ЧатСсылка;
			ЗаписьОчереди.Статус = Перечисления.iga_СтатусыОчереди.ОбщениеСБотом;
			ЗаписьОчереди.ДатаПоследнейАктивности = ТекущаяДата();
			ЗаписьОчереди.Записать();
			
			Менеджер = РегистрыСведений.iga_ПоследниеСтатусыЧатов.СоздатьМенеджерЗаписи();
			Менеджер.Чат = ЧатСсылка;
			Менеджер.СтатусОчереди = Перечисления.iga_СтатусыОчереди.ОбщениеСБотом;
			Менеджер.Записать();
			
		КонецЕсли;
		
	ИначеЕсли ТипЭтапа = Перечисления.iga_ТипыЭтапов.Информационный Тогда
		

		Следующий = Справочники.iga_ЭтапыСценария.ПустаяСсылка();
		Если ЭтапСсылка.ВариантыОтветов.Количество() > 0 Тогда
			Следующий = ЭтапСсылка.ВариантыОтветов[0].СледующийЭтап;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Следующий) Тогда

			ВыполнитьЭтап(ЧатСсылка, ИдЧата, ЭтапСсылка, Следующий, ЗаписьСостояния,, ВходящиеПараметры);
		Иначе
			Если ЗаписьСостояния.Выбран() Тогда
				ЗаписьСостояния.Удалить();
			КонецЕсли;
			
			ЗаписьОчереди = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
			ЗаписьОчереди.Чат = ЧатСсылка;
			ЗаписьОчереди.Прочитать();
			ЗаписьОчереди.Удалить();
		КонецЕсли;
		
	ИначеЕсли ТипЭтапа = Перечисления.iga_ТипыЭтапов.ПереводНаОператора Тогда
		

		Если ЗаписьСостояния.Выбран() Тогда
			ЗаписьСостояния.Удалить();
		КонецЕсли;
		
		ЗаписьОчереди = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		ЗаписьОчереди.Чат = ЧатСсылка;
		ЗаписьОчереди.Прочитать();
		ЗаписьОчереди.Удалить();
		
		Бот = Обработки.iga_ChatBot.Создать();
		Бот.ИнициализацияОсновныхПараметров();
		
		Бот.ПоставитьВОчередь(ЧатСсылка, Истина);
		
	ИначеЕсли ТипЭтапа = Перечисления.iga_ТипыЭтапов.Завершение Тогда
		

		Если ЗаписьСостояния.Выбран() Тогда
			ЗаписьСостояния.Удалить();
		КонецЕсли;
		
		ЗаписьОчереди = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		ЗаписьОчереди.Чат = ЧатСсылка;
		ЗаписьОчереди.Прочитать();
		ЗаписьОчереди.Удалить();

	КонецЕсли;

КонецПроцедуры

Процедура ОтправитьТекстЭтапа(ЧатСсылка, ИдЧата, ЭтапСсылка, ВходящиеПараметры = Неопределено)
	             
	Текст = ЭтапСсылка.ТекстСообщения;
	Обработчик = Обработки.iga_ОбработчикЭтапов.Создать();
	
	Обработчик.ВходящиеПараметры = Новый Структура("Чат, ИдЧата, Этап, ТекстЭтапа", ЧатСсылка, ИдЧата, ЭтапСсылка, Текст);
	
	Если Не ВходящиеПараметры = Неопределено Тогда 
		Для Каждого Параметр Из ВходящиеПараметры Цикл
			Обработчик.ВходящиеПараметры.Вставить(Параметр.Ключ, Параметр.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если ЭтапСсылка.ТипСообщения = Перечисления.iga_ТипыТекстаЭтапа.Шаблон 
		И ЗначениеЗаполнено(ЭтапСсылка.ШаблонСообщения) Тогда
		
		СтруктураСообщения = Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(ЧатСсылка, ИдЧата, ЭтапСсылка.ШаблонСообщения, ВходящиеПараметры);
		
	ИначеЕсли ЗначениеЗаполнено(Текст) Тогда
		
		Бот = Обработки.iga_ChatBot.Создать();
		Бот.ИнициализацияОсновныхПараметров();  
		
		ИтоговыйТекст = Текст;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	iga_ЭтапыСценарияПараметрыПроизвольногоТекста.ИмяПараметра КАК ИмяПараметра,
		               |	iga_ЭтапыСценарияПараметрыПроизвольногоТекста.ЗначениеИсточник КАК ЗначениеИсточник
		               |ИЗ
		               |	Справочник.iga_ЭтапыСценария.ПараметрыПроизвольногоТекста КАК iga_ЭтапыСценарияПараметрыПроизвольногоТекста
		               |ГДЕ
		               |	iga_ЭтапыСценарияПараметрыПроизвольногоТекста.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ЭтапСсылка);
		ВыборкаПараметры = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаПараметры.Следующий() Цикл
			
			Если ТипЗнч(ВыборкаПараметры.ЗначениеИсточник) = Тип("СправочникСсылка.iga_Алгоритмы") Тогда
				Попытка
					РезультатВычисления = Обработчик.ВычислитьАлгоритм(ВыборкаПараметры.ЗначениеИсточник.Алгоритм, 
						ВыборкаПараметры.ЗначениеИсточник.ПараметрыАлгоритма, Новый Массив, 
						ВыборкаПараметры.ЗначениеИсточник);
				Исключение
					Инфо = ИнформацияОбОшибке();
					ХешОшибки = iga_ОбщегоНазначенияСервер.ПолучитьКлючОшибки(Инфо);
					
					// Вызов функции записи из предыдущего ответа (с передачей готового Хеша)
					iga_ОбщегоНазначенияСервер.ЗарегистрироватьОшибкуБота(ХешОшибки, "Чат: " + ВходящиеПараметры.Чат + Символы.ПС + ПодробноеПредставлениеОшибки(Инфо));
					ВызватьИсключение("Ошибка алгоритма заполнения текста этапа. Проверьте журнал.");
				КонецПопытки;
					
			Иначе
				РезультатВычисления = Строка(ВыборкаПараметры.ЗначениеИсточник);
			КонецЕсли;

            ИтоговыйТекст = СтрЗаменить(ИтоговыйТекст, "{" + ВыборкаПараметры.ИмяПараметра + "}", РезультатВычисления);
			
		КонецЦикла;
		
		Бот.ОтправитьПростоеСообщение(ЧатСсылка, ИдЧата, ИтоговыйТекст);
	КонецЕсли;
	
КонецПроцедуры
